CREATE DATABASE TransferDB;

CREATE TABLE "carrier" (
  "id" serial NOT NULL,
  "name" varchar(150) NOT NULL,
  "inn" varchar(12) NOT NULL,
  "address" varchar(250) NULL,
  "country" varchar(250) NULL,
  "tax_system" varchar(45) NOT NULL,
  PRIMARY KEY ("id")
) ;


INSERT INTO public.carrier(
	name, inn, address, country, tax_system)
	VALUES ('ООО Пример', '6449013711', '566415, Читинская область, город Пушкино, ул. Гоголя, 76', 'Россия', 'Без НДС'),
			('ИП Милка', '7249010015', '385250, Калужская область, город Луховицы, пл. Гагарина, 67', 'Россия', 'НДС 0%'),
			('ООО Ласточка', '0745316011', '360129, Свердловская область, город Лотошино, ул. Косиора, 06', 'Россия', 'НДС 10%'),
			('ИП Пирожок', '1249015744', '694894, Тульская область, город Луховицы, пл. Сталина, 41', 'Россия', 'НДС 20%'),
			('ИП Корзинка', '6148010711', '075393, Челябинская область, город Луховицы, пл. Гагарина, 68', 'Россия', 'Без НДС');